'''
Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате
и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать строковые представление в формат Unicode
и также проверить тип и содержимое переменных.
'''

words = ['разработка', 'сокет', 'декоратор']

for i in words:
    print(f'\nтип переменной: {(type(i))}')
    print(f'содержание переменной - {(i)}')
    print(f'длинна строки: {(len(i))}\n')


print("= " *25)
print('А теперь из онлайн-конвертера')
print("= " *25)


words2 = [b'\xd1\x80\xd0\xb0\xd0\xb7\xd1\x80\xd0\xb0\xd0\xb1\xd0\xbe\xd1\x82\xd0\xba\xd0\xb0',
            b'\xd1\x81\xd0\xbe\xd0\xba\xd0\xb5\xd1\x82',
            b'\xd0\xb4\xd0\xb5\xd0\xba\xd0\xbe\xd1\x80\xd0\xb0\xd1\x82\xd0\xbe\xd1\x80']

for j in words2:
    print(f'\nтип переменной: {(type(j))}')
    print(f'содержание переменной - {(j)}')
    print(f'длинна строки: {(len(j))}\n')

